snowDrift_icoFoamYade/0/U
FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
	frontAndBack
	{
		type		empty;
	}

	topAndBottomAndStair
	{
		type		noSlip;
	}

	inlet
	{
		type		fixedValue;
		value		uniform (0.1 0 0);
	}

	outlet
	{
		type		zeroGradient;
	}
}

// ************************************************************************* //
