snowDrift_icoFoamYade/0/uSource

FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	object      uSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	frontAndBack
	{
		type		empty;
	}

	topAndBottomAndStair
	{
		type		calculated;
		value		uniform (0 0 0);
	}

	inlet
	{
		type		calculated;
		value		uniform (0.1 0 0);
	}

	outlet
	{
		type		zeroGradient;
	}
}

// ************************************************************************* //
