snowDrift_icoFoamYade/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/* transportModel Newtonian; */ 

nu              [0 2 -1 0 0 0 0] 1.48e-05;//1e-06;//1.48e-05;
partDensity     [1 -3 0 0 0 0 0] 20; 
fluidDensity    [1 -3 0 0 0 0 0] 1;//1; 


// ************************************************************************* //
