snowDrift_icoFoamYade/system/blockMeshDict
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0)//0
	(1 0 0)//1
	(1 1 0)//2
	(0 1 0)//3
	(0 0 1)//4
	(1 0 1)//5
	(1 1 1)//6
	(0 1 1)//7
	(0 0 0.5)//8
	(1 0 0.5)//9
	(1 1 0.5)//10
	(0 1 0.5)//11
);

blocks
(
	hex (0 1 2 3 8 9 10 11) (20 20 10) simpleGrading (1 1 1)
	hex (8 9 10 11 4 5 6 7) (20 20 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	frontAndBack
	{
		type empty;
		faces
		(
			(0 1 9 8)
			(9 8 5 4)
			(7 6 10 11)
			(11 10 2 3)
		);
	}

	topAndBottomAndStair
	{
		type wall;
		faces
		(
			(4 5 6 7)
			(0 3 2 1)
			(1 2 10 9)
		);
	}

	inlet
	{
		type wall;
		faces
		(
			(0 8 11 3)
			(8 4 7 11)
		);
	}

	outlet
	{
		type wall;
		faces
		(
			(9 10 6 5)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
